{
  "roasts": [
    "The best comeback is not through violence, it is to outsmart your opponent by insulting them intelligently with none swearing replies, also known as a punchline. Punching or physically assaulting someone is a crime, you will end up in prison with a bad record, however, insulting without using any curse word is not a crime. Without further ado, here are 55 insulting quotes for fake friends, ex bf, ex gf, enemies and haters, share it on your Facebook or Tweeter as an indirect message.",
    " I'm sorry I hurt your feelings when I called you stupid. I really thought you already knew.",
    " I'm not insulting you. I'm describing you.",
    " It's ok if you disagree with me. I can't force you to be right.",
    " I'm actually not funny. I'm just mean and people think I'm joking.",
    " If you don't want a sarcastic answer, don't ask a stupid question.",
    " I'm busy right now, can I ignore you some other time?",
    " I was wondering how you comb your hair so the horns don't show.",
    " I love rumors. I always find out amazing things about myself I never knew.",
    " Light travels faster than sound. This is why some people appear bright until they speak.",
    " Some people just need a high five. In the face. With a chair.",
    " If you don't like me, take a map, get a car, drive to hell. Have a nice trip.",
    " Oh, my bad. I'm sorry for bothering you. I forgot I only exist when you need me for something.",
    " If I wanted to kill myself I would climb your ego and jump to your IQ.",
    " I'm sorry I offended you with my common sense.",
    " Ignore me, I don't care I'm used to it anyways, I'm invisible.",
    " I love that super cute thing you do where you don't text me back for hours, adorable.",
    " I'm sorry if you don't like my honesty, but to be fair, I don't like your lies.",
    " I'm sorry you were offended when I called you a hoe. I didn't know it was a secret.",
    " If lying was a job, I know some people who would be billionaires.",
    " I may be drunk, miss, but in the morning I will be sober and you will still be ugly.",
    " Oh I didn't realize you're an expert in my life and how I should live it. Please continue while I take notes.",
    " I am just so talented. I can listen to music and ignore you at the same time.",
    " Excuse me miss, you've got a bit of face on your make up.",
    " Are you always this stupid, or are you making a special effort today?",
    " Is your ass jealous of all the shit that comes out of your mouth?",
    " The last thing I want to do is hurt you' But it's still on the list.",
    " You must have been born on a highway because that's where most accidents happen.",
    " If common sense is common why are you without it?",
    " Zombies eat brains, don't worry, you're safe.",
    " Keep rolling your eyes, maybe you'll find a brain back there.",
    " You sound better with your mouth closed.",
    " I'd slap you but that would be animal abuse.",
    " Without stupid people like you, we would have no one to laugh at. Thank you for your contribution to society.",
    " Bitch, I'd kick you in the V, but I'm afraid I'd lose my shoe.",
    " I'm not saying I hate you, but I'd unplug your life support to charge my phone.",
    " Your birth certificate is an apology letter from durex.",
    " I would love to insult you, but I'm afraid I won't do as well as your own genetics.",
    " Somewhere out there is a tree working hard to replace the oxygen you wasted, now go apologize to it.",
    " You are like the first piece of bread, everybody touches you but no one wants you.",
    " You should eat some make up, at least you'll be pretty on the inside.",
    " When your parents dropped you off at pre school, they were arrested for littering.",
    " I'd like to see things from your point of view but I can't seem to get my head that far up my ass.",
    " If I had a gun with two bullets and I was in a room with Hitler, Bin Laden, and you, I would shoot you twice.",
    " You have a face only a mother could love. I bet she tells you you're special too.",
    " Your mom should've swallowed.",
    " Stupidity is not a crime, if it is, you'll end up in jail.",
    " I can remove 90% of your beauty with a wet tissue.",
    " Learn from your parents' mistakes, use birth control.",
    " You look like something I'd draw with my left hand.",
    " You're so ugly, when you were born your mom said 'What a treasure' and your dad said 'Lets go bury it!'",
    " Your life is useless, just like your dad's condom.",
    " Why don't you slip into something more comfortable, like a coma.",
    " The best part about me, is I'm not you.",
    " I don't hate you but I'm just not necessarily excited about your existence.",
    " Don't blame a clown for acting like a clown, blame yourself for going to the circus.",
    " Oh, I'm sorry. I forgot I only exist when you need something.",
    " Listen, I'm a nice person. So if I'm an asshole to you, you need to ask yourself why.",
    " Don't take yourself so seriously, no one else does.",
    " I would like to confirm that I do not care.",
    " I would like to apologize to anyone I have not yet offended. Please be patient. I will get to you shortly.",
    " I'm sorry that my forced apology sounded insincere, I'll try to make it more convincing next time.",
    " I'm sorry for what I said when I wanted you to disappear.",
    " I'm sorry for whatever I did to make you think I give a shit about your feelings."
  ]
}